{
  "1": {
    "number": 1,
    "keyword": "The Pioneer",
    "meaning": "Independence, leadership, new beginnings, innovation",
    "detailed_meaning": "One is the number of creation and initiation. As a 1, you are a natural leader, driven by ambition and the courage to forge your own path. You thrive in independence and resist being controlled. Your challenge is to balance self-reliance with collaboration—pioneering without alienating. Channel your fierce individuality into projects that inspire others to follow."
  },
  "2": {
    "number": 2,
    "keyword": "The Diplomat",
    "meaning": "Partnership, balance, harmony, sensitivity",
    "detailed_meaning": "Two represents duality and the art of connection. You are naturally empathetic, intuitive, and attuned to the emotions of others. Your gift lies in mediation, collaboration, and creating peace. But beware: your sensitivity can become overwhelm. Learn to honor your own needs while holding space for others. True partnership begins with inner balance."
  },
  "3": {
    "number": 3,
    "keyword": "The Creator",
    "meaning": "Expression, creativity, joy, communication",
    "detailed_meaning": "Three is the number of self-expression and joyful creation. You are naturally artistic, optimistic, and magnetic. Your words, art, or presence lights up rooms. But scattered energy can dilute your gifts—focus your creativity rather than chasing every spark. Your purpose is to inspire through authentic expression, showing others that joy is a form of power."
  },
  "4": {
    "number": 4,
    "keyword": "The Builder",
    "meaning": "Structure, stability, discipline, foundation",
    "detailed_meaning": "Four is the number of solid foundations and tangible results. You are practical, reliable, and committed to creating lasting structures—whether in work, relationships, or personal development. Your challenge is rigidity: sometimes you must break your own rules to grow. Build systems that serve your evolution, not confine it. Discipline is freedom when applied with wisdom."
  },
  "5": {
    "number": 5,
    "keyword": "The Adventurer",
    "meaning": "Freedom, change, curiosity, experience",
    "detailed_meaning": "Five is the number of motion and transformation. You crave variety, adventure, and the thrill of the unknown. Your restless spirit seeks experience over security. But constant movement without reflection leads nowhere. Your lesson: freedom isn't escape—it's the courage to choose your commitments wisely. Channel your hunger for change into purposeful growth."
  },
  "6": {
    "number": 6,
    "keyword": "The Nurturer",
    "meaning": "Harmony, responsibility, compassion, service",
    "detailed_meaning": "Six is the number of care and balance. You are naturally drawn to healing, teaching, and creating harmony in your environment. Your heart is generous, but beware martyrdom—serving others shouldn't deplete you. True nurturing includes yourself. This is a time to create reciprocal relationships where care flows both ways. Responsibility can feel like love when it's freely chosen."
  },
  "7": {
    "number": 7,
    "keyword": "The Seeker",
    "meaning": "Wisdom, introspection, spirituality, analysis",
    "detailed_meaning": "Seven is the number of depth and inner knowing. You are analytical, intuitive, and naturally drawn to life's mysteries. Solitude recharges you; superficiality drains you. Your challenge: don't let the quest for understanding become isolation. Share your insights. Your wisdom has value when it touches others. Trust your inner voice—it's rarely wrong."
  },
  "8": {
    "number": 8,
    "keyword": "The Powerhouse",
    "meaning": "Abundance, authority, achievement, mastery",
    "detailed_meaning": "Eight is the number of manifestation and material power. You are ambitious, capable, and driven to achieve tangible success. Money, influence, and recognition come naturally when you align with your purpose. But power without ethics becomes tyranny. Your lesson: true abundance flows when you lead with integrity. Use your gifts to uplift, not dominate."
  },
  "9": {
    "number": 9,
    "keyword": "The Humanitarian",
    "meaning": "Completion, compassion, wisdom, universal love",
    "detailed_meaning": "Nine is the number of endings and enlightenment. You carry an old soul's wisdom and a deep concern for humanity. Your purpose transcends personal gain—you're here to serve the collective. But beware: taking on the world's suffering can crush you. Release what isn't yours to fix. Your greatest gift is showing others that compassion is strength, and letting go is an act of love."
  }
}
